{
	"HEADER":{
		"NAME":"Pavel Roslovets",
		"OCCUPATION":"Application Engineer at ",
		"COMPANY":{
			"NAME":"ETMC Exponenta",
			"HINT":"MathWorks representative in Russia"
		},
		"UNDERCONSTR":"Site is under construction",
		"PROJECTS":"Projects",
		"VIDEOS":"Videos",
		"EVENTS":"Events",
		"TITLE":"Engineering portfolio"
	},
	"PROJECT":{
		"WEBAPI":{
			"DESCRIPTION":"Connect to any WEB services from MATLAB",
			"DETAILS":"- Set of methods, templates and examples for quick creation of WEB API to work with any WEB service from MATLAB\n- Library to work with HTTP-requests\n- Support of OAuth 1.0, OAuth 2.0 access protocols"
		},
		"TBEXT":{
			"DESCRIPTION":"Extends built-in MATLAB capabilities of toolbox creating and distributing",
			"DETAILS":"- Automate toolbox building, testing and deployment to GitHub\n- Add to your toolbox ability to automatically update itself from GitHub when you deploy new version\n- Provide your toolbox with short MATLAB command that installs toolbox automatically from web\n- Easily store any data or settings in folder where toolbox is installed\n- Conveniently open toolbox documentation and examples"
		},
		"ICONS":{
			"DESCRIPTION":"Hi-res professional icons for use in MATLAB and not only",
			"DETAILS":"It contains over 1800 icons including Font Awesome, Material Design and icons from the MathWorks website.\nProvided with handsome app that helps to find desired icon, colorize it and use in App Designer, Simulink, presentations and other projects"
		},
		"GHBIN":{
			"DESCRIPTION":"One-link downloader of the latest binary from GitHub",
			"DETAILS":"Allows to users download a binary form the latest release of your project with one click. Use generated link in README.md, in download instructions or distribute it in another ways."
		},
		"OPEN":"OPEN",
		"TG":{
			"DESCRIPTION":"Telegram t.me-links mirror without ads",
			"DETAILS":"Redirect of https:\/\/t.me\/... directly to the Telegram app avoiding provider-side blocking. Looks nice, easy to use."
		},
		"ROSLOVETS":{
			"DESCRIPTION":"This site",
			"DETAILS":"The portfolio site includes descriptions and links to my projects, videos and event materials.\nSite is built with Angular 8 framework and uses Bootstrap and Angular Material libraries. Content is presented in Russian and English"
		},
		"FARYA":{
			"DESCRIPTION":"Blog of Farida Roslovets",
			"DETAILS":"The blog site includes Farya's articles, videos and contacts.\nSite is built with Angular 8 framework and uses Bootstrap and Angular Material libraries. Angular Universal is used for server-side rendering (SSR). Site database is stored in MongoDB"
		},
		"GMP":{
			"DESCRIPTION":"Self-balancing Lego EV3 robot ",
			"DETAILS":"- Build self-balancing Lego robot Gyroboy from scratch\n- Practice in control system design\n- Learn how the Model-Based Design works\n- Control Gyroboy from App Designer app or from Android\n- Have fun!"
		},
		"DATA":{
			"DESCRIPTION":"Materials for video series \"Data Analysis in MATLAB\"",
			"DETAILS":"- Data import, analysis and visualization in MATLAB\n- Work with web services and social networks\n- Statistical data and engineering signals analysis"
		},
		"EDU":{
			"DESCRIPTION":"Training for university teachers",
			"DETAILS":"Training course for teachers of higher educational institutions. Course is dedicated to MATLAB basics and to teaching with MATLAB, covers math, programming, data analysis, creation of lectures, homeworks and laboratory works.\nCourse contains materials for classes and homework in MATLAB Grader"
		},
		"INSTR":{
			"DESCRIPTION":"Control Arduino RGB LED over serial using MATLAB App Designer",
			"DETAILS":"An example of how MATLAB App Designer tool can be used to build interactive programs to control any hardware over supported protocol (i.e. serial).\nControl RGB or built-in Arduino LED. Simulink model and schematics for Arduino are provided"
		},
		"SPINNER":{
			"DESCRIPTION":"Explore spinner dynamics and 3 DOF gyroscope physics with Simscape Multibody",
			"DETAILS":"There are three models in this submission \n1. Simple psysical model of fidget spinner - easy start with Simscape Multibody \n2. Spinner Model with Friction - explore how viscous friction in bearing affects spinner rotation\n3. 3DOF gyro model - spinner in 3D. Perform interactive expirements with the gyro and learn precession and infuence of the gravity on spinner"
		},
		"SPEED":{
			"DESCRIPTION":"Measure fidget spinner speed with LEGO EV3 and Stateflow",
			"DETAILS":"Unleash the power of Stateflow state machines - use its main features to measure speed of fidget spinner.\nYou only need LEGO EV3 Brick, color sensor, fidget spinner, sheet of white paper"
		},
		"WEATHER":{
			"DESCRIPTION":"Send to ThingSpeak environmental parameters",
			"DETAILS":"Measure temperature, humidity, pressure, lightness and loudness of environent. Send data to ThinhSpeak IoT cloud for storing and processing. Script for downloading and analyzing data in MATLAB is included"
		},
		"SENSORS":{
			"DESCRIPTION":"Simulink library for IoT sensors",
			"DETAILS":"Arduino driver blocks for DHT-family humidity sensors and LPS331 barometer. Useful for IoT projects"
		},
		"FREQ":{
			"DESCRIPTION":"for civil satelite",
			"DETAILS":"Project highlights:\n- Full system model of device\n- Atomic tube model is refined according to the experiment\n- Digital filtering and multi-loop control system\n- Code generation for microcontrollers from control algorithms"
		},
		"NMTARGET":{
			"DESCRIPTION":"Support package for NeuroMatrix MB77.07 microcontroller",
			"DETAILS":"- Generation of optimized C code for MB77.07\n- Drivers library for peripheral devices\n- Library for work with touchscreen and graphical interfaces building\n- PiL-verification"
		},
		"GETINFO":"GET MORE INFO",
		"SELECTMSG":"Select something",
		"NS":{
			"DESCRIPTION":"Frontend & Backend scripts for CRM-system NetSuite",
			"DETAILS":"Development of business logic executed by events and schedule. Automatization of the creation of tasks, reports and newsletters. User interfaces creation"
		},
		"REGPRINT":{
			"DESCRIPTION":"Registration of conferences and seminars attendees",
			"DETAILS":"- Registration of participants in the SQL database\n- Badge printing\n- Recognition of the participant by QR code\n- Synchronization with CRM-system"
		},
		"CERT":{
			"DESCRIPTION":"Certification exam for MATLAB\/Simulink professionals",
			"DETAILS":"- Examination tasks in MATLAB & Simulink with auto testing\n- Frameworks for creating and testing tasks\n- Examination infrastructure with MongoDB database and apps\n- Synchronization with CRM-system"
		},
		"EXP":{
			"DESCRIPTION":"Quick access to Russian-language MATLAB resources",
			"DETAILS":"- Quick access to the Exponenta community \n- Links to training materials \n- Easy access to Russian-language documentation \n- Fast support \n- Latest news from Exponenta"
		},
		"RACECAR":{
			"DESCRIPTION":"Autonomous robot vehicle based on the MIT RACECAR\/J project",
			"DETAILS":"Algorithms for localization, planning and trajectory following, SLAM are developed in system model of the robot and tested by simulation, followed by the creation of autonomous ROS nodes by generating code and debugging on the robot"
		},
		"VIRUS":{
			"DESCRIPTION":"Virus spreading model in Stateflow with visualization",
			"DETAILS":"Simulation of contacts between chaotically moving people and the propagation of the virus among them. In a playful way, it demonstrates the effectiveness of self-isolation to prevent the spread of viral infections. The project was created during the COVID-19 pandemic"
		},
		"QUIZBOT":{
			"DESCRIPTION":"OTUS online school сhatbot for conducting surveys",
			"DETAILS":"The Telegram bot checks knowledge in various IT areas and, if the survey is successful, it issues a promotional code for a discount for purchasing an online course"
		},
		"TYPE":{
			"MATLAB":"MATLAB",
			"SIMULINK":"Simulink",
			"WEB":"WEB"
		}
	},
	"VIDEO":{
		"TYPE":{
			"VIDEO":"Video",
			"PLAYLIST":"Playlist",
			"STREAM":"Stream",
			"VIDEOS":"Videos",
			"PLAYLISTS":"Playlists",
			"STREAMS":"Streams"
		},
		"DATA":{
			"TITLE":"Data Analysis in MATLAB",
			"DETAILS":"An overview of MATLAB's capabilities in data analysis. Complete workflow from data acquisition to analysis and visualization"
		},
		"WATCH":"WATCH",
		"GMP":{
			"TITLE":"GYROBOY MATLAB PROJECT",
			"DETAILS":"Course about developing LEGO EV3 self-balancing robot from scratch implementing principles of model-based design"
		},
		"DRONE":{
			"TITLE":"Using Mini-Drones in Teaching Control Theory",
			"DETAILS":"How MIT student learn control theory by programming Parrot mini-drones from Simulink"
		},
		"DATA18":{
			"TITLE":"Data Analysis 11\/29\/2018",
			"DETAILS":"- Data analysis in MATLAB\n- Text mining\n- Machine and deep learning"
		},
		"CSD18":{
			"TITLE":"Control Systems 09\/18\/2018",
			"DETAILS":"- Physical modeling\n- Adaptive control systems design\n- Code generation from models and algorithms"
		},
		"SPINNER":{
			"TITLE":"Fidget Spinner Modeling",
			"DETAILS":"Simulate spinner with Simscape Multibody, learn physics of 3-DOF gyroscope and measue spinner speed with LEGO and Stateflow"
		},
		"CARS":{
			"TITLE":"Unmanned Vehicles Development in MATLAB",
			"DETAILS":"MATLAB Simulink provides you with a comprehensive set of instruments for unmanned vehicles development"
		},
		"COPTERS":{
			"TITLE":"Multicopter Development in Simulink",
			"DETAILS":"What system modeling is and how it helps in multicopter development"
		},
		"SERIAL":{
			"TITLE":"Work with Hardware in App Designer",
			"DETAILS":"Learn how to use App Designer to create interactive apps to work with hardware (Arduino example)"
		},
		"MATERIALS":"MATERIALS",
		"EXP":{
			"TITLE":"Exponenta's New Projects 09\/29\/2019",
			"DETAILS":"Presentation of Exponenta Community, Russian-language MATLAB documentation and free Exponenta Toolbox for quick access to Russian-language materials and support"
		},
		"DATA20":{
			"TITLE":"Data Analysis and Machine Learning in MATLAB Course",
			"DETAILS":"1. Data analysis and preprocessing, preparation for machine learning\n2. Machine learning, model selection and analysis\n3. Big data analysis, machine learning on big data"
		}
	},
	"EVENT":{
		"TYPE":{
			"SEMINAR":"Seminar",
			"WEBINAR":"Webinar",
			"SEMINARS":"Seminars",
			"WEBINARS":"Webinars"
		},
		"MATERIALS":"MATERIALS",
		"ROBOTICS":{
			"TITLE":"Mobile Robots Navigation",
			"DETAILS":"About robots modeling, creating path planning and following algorithms and mobile robots navigation"
		},
		"CSD19":{
			"TITLE":"Control System Design",
			"DETAILS":"Using an electric motor as an example, we cover the complete development cycle of control systems according to the method of model-based design"
		},
		"PREDMAINT":{
			"TITLE":"Predictive Maintenance Design",
			"DETAILS":"Development of failure forecasting algorithms in MATLAB from receiving failure data to deployment in production"
		},
		"AERO19":{
			"TITLE":"Flight Control System Design",
			"DETAILS":"Seminar covers control systems design for aerial vehicles according to model-based design principles from plane modeling to deploying of the algorithm on a real quadcopter"
		},
		"ROBMAN":{
			"TITLE":"Robotic Manipulators Design",
			"DETAILS":"Modeling complex kinematics and dynamics of manipulators, development of control algorithms, testing and implementation"
		},
		"DTWIN":{
			"TITLE":"System Modeling and Digital Twins",
			"DETAILS":"How digital twins are connected with system modeling and how to develop it in MATLAB\/Simulink"
		},
		"DATAWEB":{
			"TITLE":"Data Analysis and Machine Learning in MATLAB",
			"DETAILS":"About MATLAB tools for importing, processing and analyzing data and creating efficient machine learning models"
		},
		"STATEFLOW":{
			"TITLE":"Effective development of control logic",
			"DETAILS":"I show how to create control logic in the form of Stateflow diagrams, test and debug it by simulation in various situations, then run it on the microcontroller by generating code and debug in real time"
		},
		"AUTONOMOUS":{
			"TITLE":"Development of Autonomous Vehicles in MATLAB Simulink",
			"DETAILS":"The seminar is devoted to the development in MATLAB Simulink of localization, navigation and planning algorithms for autonomous vehicles. It also covers creating dynamic models of control objects and code generation for embedded systems from algorithms"
		},
		"AUTONOMOUS20":{
			"TITLE":"Development of Autonomous Systems",
			"DETAILS":"The report is devoted to modern tools for modeling and developing algorithms for various unmanned systems. Topics covered:\n- System modeling\n- Robot algorithms and artificial intelligence\n- Testing and implementation of algorithms"
		},
		"PREDMAINT20":{
			"TITLE":"Predictive Maintenance with Digital Twins",
			"DETAILS":"- What is a \"digital twin\", and by what tools is it created\n- How digital twins work and maintain their equality with the real device\n- What are the methods of predictive maintenance and how digital twins help in this"
		},
		"COMPILER20":{
			"TITLE":"Build Standalone Applications in MATLAB and Simulink",
			"DETAILS":"The webinar discusses ways to create standalone applications from MATLAB algorithms and Simulink models. Special attention is paid to the creation of libraries for various programming languages, as well as the creation of web applications running on MATLAB Web App Server"
		},
		"DIGTWIN20":{
			"TITLE":"Digital Twins and Virtual Benches with Simulink Compiler",
			"DETAILS":"Consider the functionality that allows you to run on servers and computers full-fledged self-refining digital twins, simulators and virtual stands designed for mass use by enterprise employees"
		}
	}
}
