{
	"HEADER":{
		"NAME":"Павел Рословец",
		"OCCUPATION":"Инженер ",
		"COMPANY":{
			"NAME":"ЦИТМ \"Экспонента\"",
			"HINT":"Представитель MathWorks в России"
		},
		"UNDERCONSTR":"Сайт находится в разработке",
		"PROJECTS":"Проекты",
		"VIDEOS":"Видео",
		"EVENTS":"События",
		"TITLE":"Инженерное портфолио"
	},
	"PROJECT":{
		"WEBAPI":{
			"DESCRIPTION":"Работа с веб-сервисами напрямую из MATLAB",
			"DETAILS":"- Набор функций, шаблонов и примеров для быстрого создания API для работы с любыми веб-сервисами из MATLAB\n- Библиотека для удобной работы с HTTP-запросами\n- Поддержка протоколов авторизации OAuth 1.0 и OAuth 2.0"
		},
		"TBEXT":{
			"DESCRIPTION":"Расширяет возможности MATLAB по созданию и распространению тулбоксов",
			"DETAILS":"- Автоматизируйте создание, тестирование и распространение через GitHub своих тулбоксов\n- Добавляйте в тулбоксы возможность автоматического обновления до последней версии через GitHub\n- Получите короткую команду MATLAB для быстрой автоустановки тулбокса через интернет\n- Сохраняйте данные и настройки тулбокса в его папке\n- Легко открывайте документацию и примеры тулбокса"
		},
		"ICONS":{
			"DESCRIPTION":"Профессиональные иконки для использования в MATLAB и не только",
			"DETAILS":"Содержит более 1800 иконок, в том числе Font Awesome, Material Design и иконки с сайта MathWorks.\nВ комплекте удобное приложение для быстрого поиска, раскраски и использования иконок в App Designer, Simulink, презентациях и других проектах"
		},
		"GHBIN":{
			"DESCRIPTION":"Загрузка бинарного файла последнего релиза с GitHub по ссылке",
			"DETAILS":"Позволяет пользователям скачать установочный или бинарный файл последней версии вашего проекта одним кликом. Используйте сгенерированную ссылку в файле README.md, инструкции по установке или распространяйте другим образом"
		},
		"OPEN":"ОТКРЫТЬ",
		"TG":{
			"DESCRIPTION":"Зеркало Telegram-ссылок t.me\/ без рекламы",
			"DETAILS":"Перенаправляет ссылки типа https:\/\/t.me\/... в приложение Telegram в обход любых блокировок провайдерами. Красиво выглядит, просто использовать"
		},
		"ROSLOVETS":{
			"DESCRIPTION":"Этот сайт",
			"DETAILS":"Сайт-портфолио содержит описание и ссылки на мои проекты, видео и материалы мероприятий.\nСайт построен на Angular 8 с использованием библиотек Bootstrap и Angular Material. Контент представлен на русском и английском языках"
		},
		"FARYA":{
			"DESCRIPTION":"Блог Фариды Рословец",
			"DETAILS":"Сайт-блог содержит статьи, видео и контакты Фари.\nСайт построен на Angular 8 с использованием библиотек Bootstrap и Angular Material. Используется Angular Universal для отрисовки сайта на стороне сервера (SSR). Данные хранятся в базе MongoDB"
		},
		"GMP":{
			"DESCRIPTION":"Двухколесный робот-балансер из Lego EV3",
			"DETAILS":"- Создайте робота-балансера с нуля\n- Поупражняйтесь в разработке систем управления\n- На практике освойте модельно-ориентированное проектирование\n- Управляйте роботом из графического приложения App Designer или с Android-смартфона\n- Развлекайтесь!"
		},
		"DATA":{
			"DESCRIPTION":"Материалы к серии видео “Анализ данных в MATLAB”",
			"DETAILS":"- Импорт, анализ, и визуализация данных в MATLAB\n- Работа с веб-сервисами и соцсетями\n- Анализ статистических и инженерных данных"
		},
		"EDU":{
			"DESCRIPTION":"Учебный курс «MATLAB для преподавателей»",
			"DETAILS":"Учебный курс для обучения преподавателей высших учебных заведений основам MATLAB и преподаванию с помощью MATLAB. Покрывает такие темы как математика, программирование, анализ данных, создание лекций, лабораторных, домашних заданий и другие.\nКурс содержит файлы для занятий в классе и для самостоятельной работы в MATLAB Grader"
		},
		"INSTR":{
			"DESCRIPTION":"Управление RGB-светодиодом по COM-порту из приложения App Designer",
			"DETAILS":"Пример того, как можно с помощью MATLAB App Designer создавать интерактивные приложения для управления оборудованием через поддерживаемые интерфейсы (например, через последовательный).\nУправляйте RGB или встроенным в Arduino светодиодом. В комплекте Simulink-модель и схема подключения для Arduino"
		},
		"SPINNER":{
			"DESCRIPTION":"Исследуйте динамику спиннера и физику трехстепенного гироскопа с Simscape Multibody",
			"DETAILS":"В комплекте 3 модели:\n1. Простая физическая модель спиннера - введение в Simscape Multibody\n2. Модель спиннера с трением - исследуйте влияние вязкого трения в подшипнике на вращение\n3. Спиннер в 3D - трехстепенный гироскоп. Выполняйте интерактивные эксперименты и исследуйте прецессию и влияние гравитации"
		},
		"SPEED":{
			"DESCRIPTION":"Измерьте скорость вращения спиннера с LEGO EV3 и Stateflow",
			"DETAILS":"Используйте мощь конечных автоматов Stateflow для измерения скорости спиннера.\nВам потребуются лишь блок LEGO EV3, датчик цвета, спиннер и лист белой бумаги"
		},
		"WEATHER":{
			"DESCRIPTION":"Отправляет в ThingSpeak параметры окружающей среды",
			"DETAILS":"Измеряет температуру, влажность, давление, уровень освещенности и шума. Данные отправляются в IoT-облако ThingSpeak для хранения и обработки. В комплекте скрипт для скачивания данных и их анализа в MATLAB"
		},
		"SENSORS":{
			"DESCRIPTION":"Simulink библиотека для датчиков IoT",
			"DETAILS":"Блоки Arduino-драйверов для датчиков влажности семейства DHT и датчика давления LPS331. Могут пригодиться в проектах, посвященных интернету вещей"
		},
		"FREQ":{
			"DESCRIPTION":"Атомный стандарт частоты для гражданского спутника",
			"DETAILS":"Особенности проекта:\n- Полноценная системная модель устройства\n- Модель атомной трубки уточнена по результатам испытаний\n- Цифровая фильтрация и многоконтурная система управления\n- Генерация кода для микроконтроллеров из алгоритмов управления"
		},
		"NMTARGET":{
			"DESCRIPTION":"Пакет поддержки для микроконтроллера NeuroMatrix MB77.07",
			"DETAILS":"- Генерация оптимизированного C кода для MB77.07\n- Библиотека блоков драйверов периферийных устройств\n- Библиотека для работы с сенсорным экраном и построения интерфейсов\n- PiL-верификация"
		},
		"GETINFO":"УЗНАТЬ БОЛЬШЕ",
		"SELECTMSG":"Выберите что-нибудь",
		"NS":{
			"DESCRIPTION":"Frontend и Backend скрипты для CRM-системы NetSuite",
			"DETAILS":"Создание бизнес-логики, исполняемой по событиям и по расписанию. Автоматизация создания задач, отчетов и рассылок. Создание пользовательских интерфейсов"
		},
		"REGPRINT":{
			"DESCRIPTION":"Регистрация участников конференций и семинаров",
			"DETAILS":"- Регистрация участников в базе данных SQL\n- Печать бейджа\n- Распознавание участника по QR-коду\n- Синхронизация с CRM-системой"
		},
		"CERT":{
			"DESCRIPTION":"Сертификационный экзамен для профессионалов MATLAB\/Simulink",
			"DETAILS":"- Экзаменационные задания в MATLAB и Simulink с автопроверкой\n- Фреймворк для созданния и тестирование заданий\n- Инфраструктура с базой данных MongoDB и приложения для экзамена\n- Синхронизация с CRM-системой"
		},
		"EXP":{
			"DESCRIPTION":"Быстрый доступ к русскоязычным ресурсам по MATLAB",
			"DETAILS":"- Удобный доступ к сообществу Экспонента \n- Ссылки на обучающие материалы \n- Простой доступ к русскоязычной документации \n- Быстрое получение поддержки \n- Последние новости от Экспоненты"
		},
		"RACECAR":{
			"DESCRIPTION":"Автономный робот, постренный на базе проекта MIT RACECAR\/J",
			"DETAILS":"Алгоритмы локалицазии, планирования и следования траектории, SLAM разработаны в рамках системной модели робота и протестированы путем симуляции с последующим созданием автономных ROS-узлов путем генерации кода и отладкой на роботе"
		},
		"VIRUS":{
			"DESCRIPTION":"Модель распространения вируса в Stateflow с визуализацией",
			"DETAILS":"Симуляция столкновений хаотично перемещающихся людей и передачи вируса между ними. В игровой форме демонстрирует эффективность самоизоляции для предотвращения распространения вирусных инфекций. Проект создан в период пандемии COVID-19"
		},
		"QUIZBOT":{
			"DESCRIPTION":"Чат-бот для проведения опросов онлайн-школы ОТУС",
			"DETAILS":"Telegram-бот проверяет знания по разным IT-направлениям и в случае успешного прохождения опроса выдает промокод на скиду для приобретения онлайн-курса"
		},
		"TYPE":{
			"MATLAB":"MATLAB",
			"SIMULINK":"Simulink",
			"WEB":"Веб"
		}
	},
	"VIDEO":{
		"TYPE":{
			"VIDEO":"Ролик",
			"PLAYLIST":"Плейлист",
			"STREAM":"Стрим",
			"VIDEOS":"Ролики",
			"PLAYLISTS":"Плейлисты",
			"STREAMS":"Стримы"
		},
		"DATA":{
			"TITLE":"Анализ данных в MATLAB",
			"DETAILS":"Обзор возможностей MATLAB по анализу данных. Рассмотрен полный рабочий процесс от получения данных до их анализа и визуализации"
		},
		"WATCH":"СМОТРЕТЬ",
		"GMP":{
			"TITLE":"GYROBOY MATLAB PROJECT",
			"DETAILS":"Учебный курс о разработке робота-балансера на базе LEGO EV3 с нуля по принципу модельно-ориентированного проектирования"
		},
		"DRONE":{
			"TITLE":"Использование мини-дронов при обучении теории управления",
			"DETAILS":"Как студенты MIT изучают теорию управления, программируя компактных дронов Parrot из Simulink"
		},
		"DATA18":{
			"TITLE":"Анализ данных 29.11.2018",
			"DETAILS":"- Анализ данных в MATLAB\n- Текстовый анализ\n- Машинное и глубокое обучение"
		},
		"CSD18":{
			"TITLE":"Системы управления 18.09.2018",
			"DETAILS":"- Физическое моделирование\n- Разработка адаптивных систем управления\n- Генерация кода из моделей и алгоритмов"
		},
		"SPINNER":{
			"TITLE":"Моделирование спиннера",
			"DETAILS":"Моделируем спиннер в Simscape Multibody, изучаем физику трехстепенного гироскопа и измеряем скорость спиннера с помощью LEGO и Stateflow"
		},
		"CARS":{
			"TITLE":"Разработка беспилотного транспорта в MATLAB",
			"DETAILS":"MATLAB Simulink предоставляет вам исчерпывающий набор инструментов для разработки беспилотного транспорта"
		},
		"COPTERS":{
			"TITLE":"Разработка мультикоптеров в Simulink",
			"DETAILS":"Что такое системное моделирование и как оно помогает в разработке мультикоптеров"
		},
		"SERIAL":{
			"TITLE":"Создание интерфейсов для работы с аппаратурой в App Designer",
			"DETAILS":"Научитесь использовать App Designer для создания интерактивных приложений для работы с оборудованием (пример с Arduino)"
		},
		"MATERIALS":"МАТЕРИАЛЫ",
		"EXP":{
			"TITLE":"Новые проекты Экспоненты 29.09.2019",
			"DETAILS":"Презентация сообщества Экспонента, русскоязычной документации по MATLAB и бесплатного Exponenta Toolbox для быстрого доступа к русскоязычным материалам и поддержке"
		},
		"DATA20":{
			"TITLE":"Курс «Анализ данных и машинное обучение в MATLAB»",
			"DETAILS":"1. Анализ и фильтрация данных, подготовка для машинного обучения\n2. Машинное обучение, выбор и анализ моделей\n3. Анализ больших данных, машинное обучение на больших данных"
		}
	},
	"EVENT":{
		"TYPE":{
			"SEMINAR":"Семинар",
			"WEBINAR":"Вебинар",
			"SEMINARS":"Семинары",
			"WEBINARS":"Вебинары"
		},
		"MATERIALS":"МАТЕРИАЛЫ",
		"ROBOTICS":{
			"TITLE":"Навигация мобильных роботов",
			"DETAILS":"Вебинар посвящен моделированию роботов, созданию алгоритмов планирования и следования траектории, а также навигации роботов в пространстве"
		},
		"CSD19":{
			"TITLE":"Разработка и настройка систем управления",
			"DETAILS":"На примере электродвигателя разбираем полный цикл разработки систем управления по методу модельно-ориентированного проектирования"
		},
		"PREDMAINT":{
			"TITLE":"Разработка алгоритмов Predictive Maintenance",
			"DETAILS":"О разработке алгоритмов предсказания отказов в MATLAB начиная с получения данных по отказам, заканчивая развертыванием в проиозводстве"
		},
		"AERO19":{
			"TITLE":"Разработка авиационных систем управления",
			"DETAILS":"Семинар посвящен разработке систем управления летательным аппаратами по методу модельно-ориентированного проектирования от моделирования объекта до запуска алгоритма на реальном квадракоптере"
		},
		"ROBMAN":{
			"TITLE":"Проектирование роботов-манипуляторов",
			"DETAILS":"Моделирование сложной кинематики и динамики манипуляторов, разработка алгоритмов управления, их тестирование и реализация"
		},
		"DTWIN":{
			"TITLE":"Системное моделирование и цифровые двойники",
			"DETAILS":"Как цифровые двойники связаны с системным моделированием, и какие возможности по их разработке есть в MATLAB\/Simulink"
		},
		"DATAWEB":{
			"TITLE":"Анализ данных и машинное обучение в MATLAB",
			"DETAILS":"Об инструментах MATLAB для импорта, обработки и анализа данных и создании эффективных моделей машинного обучения"
		},
		"STATEFLOW":{
			"TITLE":"Эффективная разработка управляющей логики",
			"DETAILS":"Показываю, как создавать управляющую логику в виде диаграмм Stateflow, тестировать и отлаживать ее путем симуляции в различных ситуациях, затем запускаю ее на микроконтролере путем генерации кода и отлаживаю в реальном времени"
		},
		"AUTONOMOUS":{
			"TITLE":"Разработка автономного транспорта в MATLAB Simulink",
			"DETAILS":"Семинар посвящен разработке в MATLAB Simulink алгоритмов локализации, навигации и планирования для автономных транспортных средств. Затронуты темы создания динамических моделей объектов управления и генерации кода для встраиваемых систем из алгоритмов"
		},
		"AUTONOMOUS20":{
			"TITLE":"Разработка автономных систем",
			"DETAILS":"Доклад посвящен современным инструментам моделирования и разработки алгоритмов различных беспилотных систем. Рассмотрены темы:\n- системное моделирование\n- алгоритмы роботов и искусственный интеллект\n- тестирование и реализация алгоритмов"
		},
		"PREDMAINT20":{
			"TITLE":"Предсказание отказов с помощью цифровых двойников",
			"DETAILS":"- Что такое «цифровой двойник», и какими средствами он создается\n- Как цифровые двойники работают и сохраняют свою идентичность реальному устройству\n- Какие есть методы предсказательного обслуживания и как в этом помогают цифровые двойники"
		},
		"COMPILER20":{
			"TITLE":"Создание независимых приложений в MATLAB и Simulink",
			"DETAILS":"На вебинаре рассмотрены способы создания независимых приложений из алгоритмов MATLAB и моделей Simulink. Отдельное внимание уделено созданию библиотек для различных языков программирования, а также созданию веб-приложений, работающих на MATLAB Web App Server"
		},
		"DIGTWIN20":{
			"TITLE":"Создание цифровых двойников и виртуальных стендов с Simulink Compiler",
			"DETAILS":"Рассмотрим функционал, который позволяет запускать на серверах и компьютерах без MATLAB полноценные самоуточняющиеся цифровые двойники, тренажеры и виртуальные стенды, предназначенные для массового использования сотрудниками предприятия"
		}
	}
}
